app/Controllers/Admin/Berita.php

		}elseif($submit=='Delete') {
			for($i=0; $i < sizeof($id_berita);$i++) {
				$data = array(	'id_berita'	=> $id_berita[$i]);
   				$m_berita->delete($data);
---
DELETE FROM `berita`
WHERE `id_berita` IN ('1')