app/Models/Berita_model.php

SELECT *
FROM `berita`
---
    public function total()
    {
        $this->table('berita');
        $query = $this->get();