app/Models/Kategori_model.php

    public function listing()
    {
        $builder = $this->db->table('kategori');
        $builder->select('*');
        $builder->orderBy('kategori.id_kategori','DESC');
        $query = $builder->get();
---
SELECT *
FROM `kategori`
ORDER BY `kategori`.`id_kategori` DESC