app/Models/Konfigurasi_model.php

SELECT *
FROM `konfigurasi`
---
    public function listing()
    {
        $builder = $this->db->table('konfigurasi');
        $builder->select('*');
        $query = $builder->get();